Final_ADOT_program/Aerodynamics_Simulation/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            totalPressure;
        rho             none;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    lowerWall
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
